src/Catalogs/ЕРПМаппингДляЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЕРПМаппингДляЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеТаблицыTPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМетаданныхСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключенияTPI</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕРПНастрокиПодключенияTPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияСправочника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьНовые</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗагружатьНовыеЭлементыВСправочник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНСИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьГруппыКакЭлементы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРегистрСведений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Маппинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоляTPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураМаппинга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокЗагрузки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПерезаписыватьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполнятьДляГруппы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаппингТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоляTPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцедураМаппинга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТаблицыTPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЕРПМаппингДляЗагрузки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьСправочникиНаСервере()
	ЕРПЗагрузкаНСИ.ЗагрузитьНСИизTPI();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочники(Команда)
	ЗагрузитьСправочникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНастройкиНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕРПМаппингДляЗагрузки.Ссылка,
	|	ЕРПМаппингДляЗагрузки.ВерсияДанных,
	|	ЕРПМаппингДляЗагрузки.ПометкаУдаления,
	|	ЕРПМаппингДляЗагрузки.Код,
	|	ЕРПМаппингДляЗагрузки.Наименование,
	|	ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI,
	|	ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника,
	|	ЕРПМаппингДляЗагрузки.ТекущееЗначениеСчетчика,
	|	ЕРПМаппингДляЗагрузки.НастройкаПодключенияTPI,
	|	ЕРПМаппингДляЗагрузки.ПорядокЗагрузки,
	|	ЕРПМаппингДляЗагрузки.ЗапретРедактированияСправочника,
	|	ЕРПМаппингДляЗагрузки.РегистрироватьНовые,
	|	ЕРПМаппингДляЗагрузки.Маппинг.(
	|		НомерСтроки,
	|		НаименованиеПоляTPI,
	|		ИмяРеквизита,
	|		Пометка,
	|		ПроцедураМаппинга,
	|		ПорядокЗагрузки,
	|		ПоискПоНаименованию
	|	)
	|ИЗ
	|	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки");
	Результат = Запрос.Выполнить().Выгрузить();
	Сообщить(Результат.Количество());
	ЗначениеВФайл("\\10.0.4.29\Supermag1C\Врем",Результат);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	ВыгрузитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере()
	Результат = ЗначениеИзФайла("\\10.0.4.29\Supermag1C\Врем");
	Сообщить(Результат.Количество());
	Для каждого ТекСтрока из Результат Цикл
		Найден = Справочники.ЕРПМаппингДляЗагрузки.НайтиПоКоду(ТекСтрока.Код);
		Если НЕ ЗначениеЗаполнено(Найден) тогда
			НовСпр = Справочники.ЕРПМаппингДляЗагрузки.СоздатьЭлемент();
		Иначе
			НовСпр = Найден.ПолучитьОбъект();  			
		КонецЕсли; 	
		ЗаполнитьЗначенияСвойств(НовСпр,ТекСтрока);
		НовСпр.Маппинг.Загрузить(ТекСтрока.Маппинг);
		//Для каждого ТекСтр из ТекСтрока.Маппинг Цикл
		//	Новстр = НовСпр.Маппинг.Добавить();
		//	ЗаполнитьЗначенияСвойств(Новстр,ТекСтр);
		//КонецЦикла;
		НовСпр.Записать();
		Сообщить(НовСпр.Ссылка);  		 	
	КонецЦикла;  	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	ЗагрузитьНастройкиНаСервере();
КонецПроцедуры
